Repository: BARAKA98DAUDI/Wakala
Catalog: core/locale/*/LC_MESSAGES/django.po
Languages: fr, sw

source: Enter a valid monetary amount.
fr: Entrez un montant monétaire valide.
sw: Weka kiasi sahihi cha pesa.

source: Amount must be positive.
fr: Le montant doit être positif.
sw: Kiasi lazima kiwe chanya.

source: %(network)s – %(amount)s TZS on %(date)s
fr: %(network)s – %(amount)s TZS le %(date)s
sw: %(network)s – %(amount)s TZS tarehe %(date)s

source: Dashboard - %(user.username)s
fr: Tableau de bord - %(user.username)s
sw: Dashibodi - %(user.username)s

source: Welcome, %(user.username)s
fr: Bienvenue, %(user.username)s
sw: Karibu, %(user.username)s

source: Transaction actions
fr: Actions de transaction
sw: Vitendo vya Muamala

source: Add Transaction
fr: Ajouter une transaction
sw: Ongeza Muamala

source: History
fr: Historique
sw: Historia

source: Logout
fr: Déconnexion
sw: Toka

source: Start‑of‑day float not set for:
fr: Flottant de début de journée non défini pour :
sw: Salio la mwanzo wa siku halijawekwa kwa:

source: Please set the start balance below.
fr: Veuillez définir le solde de départ ci-dessous.
sw: Tafadhali weka salio la mwanzo hapa chini.

source: Wallet Float Summary (Today)
fr: Résumé du flottant du portefeuille (aujourd’hui)
sw: Muhtasari wa Salio la Wallet (Leo)

source: Network
fr: Réseau
sw: Mtandao

source: Start Balance
fr: Solde de départ
sw: Salio la Mwanzo

source: Refill
fr: Recharger
sw: Jaza Tena

source: Cash In
fr: Encaissement
sw: Pesa Inazoingia

source: Cash Out
fr: Décaissement
sw: Pesa Zinazotoka

source: Today Balance
fr: Solde du jour
sw: Salio la Leo

source: No logo
fr: Pas de logo
sw: Hakuna nembo

source: Set Start-of-Day Float
fr: Définir le flottant de début de journée
sw: Weka Salio la Mwanzo wa Siku

source: Save Start Balance
fr: Enregistrer le solde de départ
sw: Hifadhi Salio la Mwanzo

source: Start Date:
fr: Date de début :
sw: Tarehe ya Kuanza:

source: End Date:
fr: Date de fin :
sw: Tarehe ya Mwisho:

source: Network:
fr: Réseau :
sw: Mtandao:

source: All Networks
fr: Tous les réseaux
sw: Mitandao Yote

source: Filter
fr: Filtrer
sw: Chuja

source: Daily Analytics
fr: Analytique quotidienne
sw: Takwimu za Kila Siku

source: Today’s Cash In:
fr: Encaissement aujourd’hui :
sw: Pesa Inazoingia Leo:

source: Today’s Cash Out:
fr: Décaissement aujourd’hui :
sw: Pesa Zinazotoka Leo:

source: Total Cash In:
fr: Total des encaissements :
sw: Jumla ya Pesa Inazoingia:

source: Total Cash Out:
fr: Total des décaissements :
sw: Jumla ya Pesa Zinazotoka:

source: Today's Float Overview
fr: Aperçu du flottant d’aujourd’hui
sw: Muhtasari wa Salio la Leo

source: Total Float Today:
fr: Flottant total aujourd’hui :
sw: Jumla ya Salio Leo:

source: Average Float Spent:
fr: Flottant moyen dépensé :
sw: Wastani wa Salio Lililotumika:

source: %(net)s — Refilled: %(refill)s TZS, Spent: %(spent)s TZS, Total Float: %(float)s TZS
fr: %(net)s — Rechargé : %(refill)s TZS, Dépensé : %(spent)s TZS, Flottant total : %(float)s TZS
sw: %(net)s — Imejazwa: %(refill)s TZS, Imetumika: %(spent)s TZS, Jumla ya Salio: %(float)s TZS

source: Recent Transactions
fr: Transactions récentes
sw: Miamala ya Hivi Karibuni

source: Admin Panel
fr: Panneau d'administration
sw: Jopo la Msimamizi

source: Admin
fr: Administrateur
sw: Msimamizi

source: Export PDF
fr: Exporter en PDF
sw: Hamisha PDF

source: Weekly Cash Flow
fr: Flux de trésorerie hebdomadaire
sw: Mtiririko wa Pesa wa Wiki

source: Refill History
fr: Historique des recharges
sw: Historia ya Kujaza

source: Date
sw: Tarehe

source: Amount (TZS)
fr: Montant (TZS)
sw: Kiasi (TZS)

source: No refill history found.
fr: Aucune recharge trouvée.
sw: Hakuna historia ya kujaza iliyopatikana.

source: Back to Dashboard
fr: Retour au tableau de bord
sw: Rudi kwenye Dashibodi

source: Float Refill
fr: Recharge du flottant
sw: Jaza Salio

source: User Registration
fr: Enregistrement de l'utilisateur
sw: Usajili wa Mtumiaji

source: Register
fr: S'inscrire
sw: Sajili

source: Already have an account?
fr: Vous avez déjà un compte ?
sw: Tayari una akaunti?

source: Login
fr: Connexion
sw: Ingia

source: Transaction History
fr: Historique des transactions
sw: Historia ya Miamala

source: All
fr: Tout
sw: Yote

source: Type
sw: Aina

source: ID
sw: Nambari ya Utambulisho

source: Date/Time
fr: Date/Heure
sw: Tarehe/Muda

source: No transactions found.
fr: Aucune transaction trouvée.
sw: Hakuna miamala iliyopatikana.

source: You must set float for all your wallets before accessing the dashboard.
fr: Vous devez définir le flottant pour tous vos portefeuilles avant d’accéder au tableau de bord.
sw: Lazima uweke salio kwa kila wallet yako kabla ya kufikia dashibodi.

source: Invalid date format provided.
fr: Format de date fourni invalide.
sw: Umbizo la tarehe si sahihi.

source: Wallet start balance updated successfully.
fr: Solde de départ du portefeuille mis à jour avec succès.
sw: Salio la mwanzo la wallet limeboreshwa kikamilifu.

source: Invalid form data submitted.
fr: Données de formulaire invalides soumises.
sw: Fomu iliyowasilishwa ina makosa.

source: Dashboard
fr: Tableau de bord
sw: Dashibodi

source: Registration successful. Welcome!
fr: Inscription réussie. Bienvenue !
sw: Usajili umefanikiwa. Karibu!

source: There was an error in your registration form.
fr: Une erreur est survenue dans votre formulaire d'inscription.
sw: Kulikuwa na kosa kwenye fomu yako ya usajili.

source: Transaction saved!
fr: Transaction enregistrée !
sw: Muamala umehifadhiwa!

source: attachment; filename="transactions.pdf"
fr: pièce jointe ; nom du fichier="transactions.pdf"
sw: kiambatisho; jina la faili="miamala.pdf"

source: PDF generation failed
fr: Échec de la génération du PDF
sw: Uundaji wa PDF umeshindikana

source: Transactions
sw: Miamala

source: Amount
fr: Montant
sw: Kiasi

source: N/A
fr: N/D
sw: Haipatikani

source: attachment; filename="transactions.xlsx"
fr: pièce jointe ; nom du fichier="transactions.xlsx"
sw: kiambatisho; jina la faili="miamala.xlsx"

source: ❌ Enter a valid monetary amount.
fr: ❌ Entrez un montant monétaire valide.
sw: ❌ Tafadhali weka kiasi halali cha pesa.

source: ✅ Refill successful and balance updated.
fr: ✅ Recharge réussie et solde mis à jour.
sw: ✅ Kujaza kumefanikiwa na salio limeboreshwa.

source: ✅ Start balances set successfully.
fr: ✅ Soldes de départ définis avec succès.
sw: ✅ Salio la mwanzo limewekwa kikamilifu.

source: 📊 Wakala Daily Summary Report
fr: 📊 Rapport quotidien récapitulatif de Wakala
sw: 📊 Ripoti ya Muhtasari ya Kila Siku ya Wakala

source: 📊 Wakala Weekly Summary Report
fr: 📊 Rapport hebdomadaire récapitulatif de Wakala
sw: 📊 Ripoti ya Muhtasari ya Kila Wiki ya Wakala

source: Date Range:
fr: Plage de dates :
sw: Kipindi cha Tarehe:

source: Total Cash In:
fr: Total des encaissements :
sw: Jumla ya Pesa Inazoingia:

source: Total Cash Out:
fr: Total des décaissements :
sw: Jumla ya Pesa Zinazotoka:

source: Balance:
fr: Solde :
sw: Salio:
